<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>edu.maine.eut.package.GPlates</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>GPlates</string>
		<key>app_name</key>
		<string>gplates.app</string>
	</dict>
	<key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
        <string>URLDownloader</string>
        <key>Arguments</key>
        <dict>
            <key>url</key>
            <string>https://sourceforge.net/projects/gplates/files/gplates/2.2/GPlates-2.2.0-Darwin-x86_64.dmg/download</string>
            <key>filename</key>
            <string>GPlates-2.2.0-Darwin-x86_64.dmg</string>
         </dict>
    </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
	</array>
</dict>
</plist>
