<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>edu.maine.eut.package.UMS-TeamViewerQS</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>TeamViewerQuickSupport</string>
		<key>VERSION</key>
		<string>latest</string>
		<key>DOWNLOAD_URL</key>
		<string>https://customdesign.teamviewer.com/download/version_15x/xveq27a_mac/TeamViewerQS.zip</string>
	</dict>
		<key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>TeamViewerQS.zip</string>
            </dict>
        </dict>
				<dict>
            <key>Processor</key>
            <string>Unarchiver</string>
        </dict>
				<dict>
						<key>Processor</key>
						<string>FileFinder</string>
						<key>Arguments</key>
						<dict>
								<key>pattern</key>
								<string>TeamViewer\ QuickSupport</string>
						</dict>
				</dict>
				<dict>
            <key>Processor</key>
            <string>PlistReader</string>
						<key>Arguments</key>
						<dict>
								<key>info_path</key>
								<string>found_filename</string>
						</dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/TeamViewer\ QuickSupport</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/TeamViewer\ QuickSupport.app</string>
                <key>destination_path</key>
                <string>%pkgroot%/Applications/TeamViewer\ QuickSupport.app</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                    <key>version</key>
                    <string>%version%</string>
                    <key>id</key>
                    <string>%bundleid%</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Applications</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
		</array>
	</dict>
</plist>
